var constants = {
    staticRef : {
        list : 'list'
    },
    weeks : {
        zh : {
            n : {
                '0':'星期日','1':'星期一','2':'星期二','3':'星期三','4':'星期四','5':'星期五','6':'星期六'
            },
            s : {
                '0':'周日','1':'周一','2':'周二','3':'周三','4':'周四','5':'周五','6':'周六'
            }
        },
        en : {
            n : {
                '0':'Sunday','1':'Monday','2':'Tuesday','3':'Wednesday','4':'Thursday','5':'Friday','6':'Saturday'
            },
            s : {
                '0':'Sun','1':'Mon','2':'Tue','3':'Wed','4':'Thu','5':'Fri','6':'Sat'
            }
        }
    },
    status : {
        '00':'已创建',
        '40':'待测试',
        '45':'已测试',
        '70':'已审核',
        '80':'已完成',
        '90':'已关闭',
        '99':'异常'
    },
    isCommon : {
        '0':'否','1':'是'
    },
    //80状态以上全部不显示
    userStatus : {
        '00' : '正常',
        '50' : '冻结',
        '90' : '离开项目组',
        '95' : '离职',
        '99' : '删除'
    },
    userOperate : {
        '00' : '请假',
        '01' : '离职',
        '02' : '离开项目组',
        '03' : '冻结',
        '04' : '入职',
        '05' : '转正'
    },
    duties : {
        '00' : '项目经理',
        '01' : '技术主管',
        '02' : '开发员',
        '03' : '测试员'
    },
    industry : {
        '00' : 'IT',
        '01' : '银行'
    },
    projectFunctionsStatus : {
        '00' : '创建',
        '02' : '待定',
        '10' : '需求已给',
        '20' : '接口字段已给',
        '30' : '调试接口',
        '40' : '测试',
        '95' : '生产',
        '99' : '失效'
    },
    taskStatus : {
        '00' : '创建',
        '10' : '确认',
        '15' : '文件已提交',
        '20' : '测试',
        '80' : 'SIT',
        '90' : 'UAT',
        '99' : '生产'
    },
    taskTypes : {
        '00' : 'bug',
        '05' : '误报',
        '10' : '代码',
        '20' : '优化',
        '90' : '重复提交'
    }
};